# Reworking Pandas on Python 3

In [3]:
import pandas as pd
import numpy as np

### 1. Assign a new Column

In [4]:
df = pd.DataFrame()
df['name'] = ['John', 'Steve', 'Sarah']
df

    name
0   John
1  Steve
2  Sarah

In [5]:
df.assign(age = [31, 32, 19])

    name  age
0   John   31
1  Steve   32
2  Sarah   19

### 2. Create A Pipeline in Pandas

In [6]:
df = pd.DataFrame()
df['name'] = ['John', 'Steve', 'Sarah']
df['gender'] = ['Male', 'Male', 'Female']
df['age'] = [31, 32, 19]
df

    name  gender  age
0   John    Male   31
1  Steve    Male   32
2  Sarah  Female   19

In [7]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [10]:
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [11]:
(df.pipe(mean_age_by_group, col='gender')
    .pipe(uppercase_column_name))

         AGE
gender
Female  19.0
Male    31.5

### 3. Group Pandas Data by Hour of the Day

In [13]:
time = pd.date_range('1/1/2000', periods=2000, freq='5min')
series = pd.Series(np.random.randint(100, size=2000), index=time)

In [17]:
series[0:10]

2000-01-01 00:00:00    29
2000-01-01 00:05:00    85
2000-01-01 00:10:00    24
2000-01-01 00:15:00    34
2000-01-01 00:20:00    87
2000-01-01 00:25:00     3
2000-01-01 00:30:00    29
2000-01-01 00:35:00    75
2000-01-01 00:40:00    25
2000-01-01 00:45:00    80
Freq: 5T, dtype: int64

In [18]:
series.groupby(series.index.hour).mean()

0     47.440476
1     51.369048
2     48.702381
3     46.190476
4     51.821429
5     50.119048
6     45.940476
7     40.654762
8     50.523810
9     42.666667
10    49.714286
11    44.809524
12    50.714286
13    45.785714
14    45.785714
15    51.166667
16    52.690476
17    52.726190
18    51.988095
19    45.678571
20    47.500000
21    48.571429
22    52.600000
23    50.083333
dtype: float64

### 4. Sort A List of Names By Last Name

In [19]:
commander_names = ['Alan Brooke', 'George Marshall', 'Frank Jack Fletcher', 'Conrad Helfrich', 'Albert Kessel']

In [22]:
sorted(commander_names, key=lambda x: x.split(" ")[-1])

['Alan Brooke',
 'Frank Jack Fletcher',
 'Conrad Helfrich',
 'Albert Kessel',
 'George Marshall']

### 5. Sort A List of Strings By Length

In [23]:
commander_names = ['Alan Brooke', 'George Marshall', 'Frank Jack Fletcher', 'Conrad Helfrich', 'Albert Kessel']

In [24]:
sorted(commander_names, key=lambda x: len(x))

['Alan Brooke',
 'Albert Kessel',
 'George Marshall',
 'Conrad Helfrich',
 'Frank Jack Fletcher']

### 6. Rename Column Headers In Pandas

In [4]:
raw = {
    '0': ['first_name', 'Molly', 'Tina', 'Jake', 'Amy'],
    '1': ['age', 52, 36, 24, 73],
    '2': ['preTestScore', 24, 31, 2, 3]
}

df = pd.DataFrame(raw)
df

            0    1             2
0  first_name  age  preTestScore
1       Molly   52            24
2        Tina   36            31
3        Jake   24             2
4         Amy   73             3

In [6]:
header = df.iloc[0]
header

0      first_name
1             age
2    preTestScore
Name: 0, dtype: object

In [7]:
df = df[1:]

In [8]:
df.rename(columns = header)

  first_name age preTestScore
1      Molly  52           24
2       Tina  36           31
3       Jake  24            2
4        Amy  73            3

### 7. Converting A String Categorical Variable To A Numeric Variable

In [9]:
raw_data = {
    'patient': [1,1,1,2,2],
    'obs': [1,2,3,1,2],
    'treatment': [0,1,0,1,0],
    'score': ['strong', 'weak', 'normal', 'weak', 'strong']
}